tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
/*
 * Tiku Operating System v0.06
 * Simple. Ubiquitous. Intelligence, Everywhere.
 * http://tiku-os.org
 *
 * Authors: Ambuj Varshney <ambuj@tiku-os.org>
 *
 * tiku_rp2350_regs.h - hand-written RP2350 register definitions.
 *
 * Just enough addresses, masks and helpers to bring the kernel up bare-metal;
 * neither the Pico SDK nor CMSIS is pulled in.  Sourced from the RP2350
 * datasheet.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef TIKU_RP2350_REGS_H_
#define TIKU_RP2350_REGS_H_

#include <stdint.h>

/*---------------------------------------------------------------------------*/
/* HELPERS                                                                   */
/*---------------------------------------------------------------------------*/

/*
 * Atomic register access aliases and accessor macros.
 *
 * Every peripheral block on the RP2350 exposes four aliases at a
 * 0x1000-byte stride: normal RW at +0x0000, XOR at +0x1000,
 * atomic SET at +0x2000, and atomic CLEAR at +0x3000.  Using the SET
 * and CLR aliases gives interrupt-safe RMW-free bit manipulation
 * without disabling the NVIC.  _RP2350_REG_SET / _CLR / _XOR use
 * these aliases; _RP2350_REG accesses the plain RW window.
 */
#define RP2350_REG_ALIAS_RW       0x0000U
#define RP2350_REG_ALIAS_XOR      0x1000U
#define RP2350_REG_ALIAS_SET      0x2000U
#define RP2350_REG_ALIAS_CLR      0x3000U

#define _RP2350_REG(addr)         (*(volatile uint32_t *)(addr))
#define _RP2350_REG_SET(addr, m)  (*(volatile uint32_t *)((addr) + RP2350_REG_ALIAS_SET) = (m))
#define _RP2350_REG_CLR(addr, m)  (*(volatile uint32_t *)((addr) + RP2350_REG_ALIAS_CLR) = (m))
#define _RP2350_REG_XOR(addr, m)  (*(volatile uint32_t *)((addr) + RP2350_REG_ALIAS_XOR) = (m))

/*---------------------------------------------------------------------------*/
/* PERIPHERAL BASE ADDRESSES                                                 */
/*---------------------------------------------------------------------------*/

/**
 * @brief Base addresses for all RP2350 peripheral blocks.
 *
 * Sourced from RP2350 datasheet §2 (memory map).  The Cortex-M33
 * private peripheral bus (PPB) lives at 0xE0000000 and is not
 * subject to the atomic-alias scheme.
 */
#define RP2350_RESETS_BASE          0x40020000UL
#define RP2350_PSM_BASE             0x40018000UL
#define RP2350_CLOCKS_BASE          0x40010000UL
#define RP2350_XOSC_BASE            0x40048000UL
#define RP2350_PLL_SYS_BASE         0x40050000UL
#define RP2350_PLL_USB_BASE         0x40058000UL
#define RP2350_IO_BANK0_BASE        0x40028000UL
#define RP2350_PADS_BANK0_BASE      0x40038000UL
#define RP2350_SIO_BASE             0xD0000000UL
#define RP2350_UART0_BASE           0x40070000UL
#define RP2350_UART1_BASE           0x40078000UL
#define RP2350_TIMER0_BASE          0x400B0000UL
#define RP2350_TIMER1_BASE          0x400B8000UL
#define RP2350_WATCHDOG_BASE        0x400D8000UL
#define RP2350_ADC_BASE             0x400A0000UL
#define RP2350_I2C0_BASE            0x40090000UL
#define RP2350_I2C1_BASE            0x40098000UL
#define RP2350_SPI0_BASE            0x40080000UL
#define RP2350_SPI1_BASE            0x40088000UL
#define RP2350_TICKS_BASE           0x40108000UL
#define RP2350_PWM_BASE             0x400A8000UL
#define RP2350_DMA_BASE             0x50000000UL
#define RP2350_PIO0_BASE            0x50200000UL
#define RP2350_PIO1_BASE            0x50300000UL
#define RP2350_PIO2_BASE            0x50400000UL
#define RP2350_TRNG_BASE            0x400F0000UL

/* Cortex-M33 SCS / NVIC / SysTick / SCB live at the standard
 * private peripheral bus addresses. */
#define RP2350_PPB_BASE             0xE0000000UL
#define RP2350_SYST_BASE            (RP2350_PPB_BASE + 0xE010UL)
#define RP2350_NVIC_BASE            (RP2350_PPB_BASE + 0xE100UL)
#define RP2350_SCB_BASE             (RP2350_PPB_BASE + 0xED00UL)
#define RP2350_MPU_BASE             (RP2350_PPB_BASE + 0xED90UL)
#define RP2350_SCB_BASE             (RP2350_PPB_BASE + 0xED00UL)

/*---------------------------------------------------------------------------*/
/* RESETS BLOCK                                                              */
/*---------------------------------------------------------------------------*/

/*
 * RESETS block — peripheral reset control (datasheet §6).
 *
 * Writing a bit to RESETS_RESET holds the peripheral in reset; clearing
 * it releases reset.  RESETS_RESET_DONE is read-back: a bit goes high
 * once the peripheral reports it is out of reset.  The per-peripheral
 * bit positions (RP2350_RESETS_*) match the LSB indices 0..28 in the
 * pico-sdk resets.h header.
 */
#define RP2350_RESETS_RESET         (RP2350_RESETS_BASE + 0x00U)
#define RP2350_RESETS_WDSEL         (RP2350_RESETS_BASE + 0x04U)
#define RP2350_RESETS_RESET_DONE    (RP2350_RESETS_BASE + 0x08U)

/*
 * RESETS_RESET bit positions, copied verbatim from
 * pico-sdk/src/rp2350/hardware_regs/include/hardware/regs/resets.h
 * (LSB indices 0..28).
 */
#define RP2350_RESETS_ADC           (1U <<  0)
#define RP2350_RESETS_BUSCTRL       (1U <<  1)
#define RP2350_RESETS_DMA           (1U <<  2)
#define RP2350_RESETS_HSTX          (1U <<  3)
#define RP2350_RESETS_I2C0          (1U <<  4)
#define RP2350_RESETS_I2C1          (1U <<  5)
#define RP2350_RESETS_IO_BANK0      (1U <<  6)
#define RP2350_RESETS_IO_QSPI       (1U <<  7)
#define RP2350_RESETS_JTAG          (1U <<  8)
#define RP2350_RESETS_PADS_BANK0    (1U <<  9)
#define RP2350_RESETS_PADS_QSPI     (1U << 10)
#define RP2350_RESETS_PIO0          (1U << 11)
#define RP2350_RESETS_PIO1          (1U << 12)
#define RP2350_RESETS_PIO2          (1U << 13)
#define RP2350_RESETS_PLL_SYS       (1U << 14)
#define RP2350_RESETS_PLL_USB       (1U << 15)
#define RP2350_RESETS_PWM           (1U << 16)
#define RP2350_RESETS_SHA256        (1U << 17)
#define RP2350_RESETS_SPI0          (1U << 18)
#define RP2350_RESETS_SPI1          (1U << 19)
#define RP2350_RESETS_SYSCFG        (1U << 20)
#define RP2350_RESETS_SYSINFO       (1U << 21)
#define RP2350_RESETS_TBMAN         (1U << 22)
#define RP2350_RESETS_TIMER0        (1U << 23)
#define RP2350_RESETS_TIMER1        (1U << 24)
#define RP2350_RESETS_TRNG          (1U << 25)
#define RP2350_RESETS_UART0         (1U << 26)
#define RP2350_RESETS_UART1         (1U << 27)
#define RP2350_RESETS_USBCTRL       (1U << 28)

