tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
/*---------------------------------------------------------------------------*/
/* CLOCKS BLOCK                                                              */
/*---------------------------------------------------------------------------*/

/*
 * Clocks block — clock source selection and dividers (datasheet §5).
 *
 * Each clock domain has a CTRL (source mux + enable), DIV (integer /
 * fractional divider), and SELECTED (readback of the active source).
 * CLK_SYS drives the CPU and most peripherals; CLK_PERI drives UART,
 * SPI, and I2C and is fixed at clk_sys with no divider once enabled.
 * Field macros (RP2350_CLK_*_AUXSRC_*, RP2350_CLK_*_SRC_*) select the
 * clock source written into the CTRL.AUXSRC or CTRL.SRC bit-fields.
 */
#define RP2350_CLK_GPOUT0_CTRL      (RP2350_CLOCKS_BASE + 0x00U)
#define RP2350_CLK_GPOUT0_DIV       (RP2350_CLOCKS_BASE + 0x04U)
#define RP2350_CLK_GPOUT0_SELECTED  (RP2350_CLOCKS_BASE + 0x08U)
#define RP2350_CLK_REF_CTRL         (RP2350_CLOCKS_BASE + 0x30U)
#define RP2350_CLK_REF_DIV          (RP2350_CLOCKS_BASE + 0x34U)
#define RP2350_CLK_REF_SELECTED     (RP2350_CLOCKS_BASE + 0x38U)
#define RP2350_CLK_SYS_CTRL         (RP2350_CLOCKS_BASE + 0x3CU)
#define RP2350_CLK_SYS_DIV          (RP2350_CLOCKS_BASE + 0x40U)
#define RP2350_CLK_SYS_SELECTED     (RP2350_CLOCKS_BASE + 0x44U)
#define RP2350_CLK_PERI_CTRL        (RP2350_CLOCKS_BASE + 0x48U)
#define RP2350_CLK_PERI_DIV         (RP2350_CLOCKS_BASE + 0x4CU)
#define RP2350_CLK_PERI_SELECTED    (RP2350_CLOCKS_BASE + 0x50U)
#define RP2350_CLK_HSTX_CTRL        (RP2350_CLOCKS_BASE + 0x54U)
#define RP2350_CLK_HSTX_DIV         (RP2350_CLOCKS_BASE + 0x58U)
#define RP2350_CLK_HSTX_SELECTED    (RP2350_CLOCKS_BASE + 0x5CU)
#define RP2350_CLK_USB_CTRL         (RP2350_CLOCKS_BASE + 0x60U)
#define RP2350_CLK_USB_DIV          (RP2350_CLOCKS_BASE + 0x64U)
#define RP2350_CLK_USB_SELECTED     (RP2350_CLOCKS_BASE + 0x68U)
#define RP2350_CLK_ADC_CTRL         (RP2350_CLOCKS_BASE + 0x6CU)
#define RP2350_CLK_ADC_DIV          (RP2350_CLOCKS_BASE + 0x70U)
#define RP2350_CLK_ADC_SELECTED     (RP2350_CLOCKS_BASE + 0x74U)

/* CLK_ADC_CTRL fields (mirrors CLK_PERI_CTRL layout) */
#define RP2350_CLK_ADC_ENABLE           (1U << 11)
#define RP2350_CLK_ADC_AUXSRC_PLL_USB   (0U << 5)
#define RP2350_CLK_ADC_AUXSRC_PLL_SYS   (1U << 5)
#define RP2350_CLK_ADC_AUXSRC_ROSC      (2U << 5)
#define RP2350_CLK_ADC_AUXSRC_XOSC      (3U << 5)

/* CLK_SYS_CTRL fields */
#define RP2350_CLK_SYS_AUXSRC_PLL_SYS   (0U << 5)
#define RP2350_CLK_SYS_AUXSRC_PLL_USB   (1U << 5)
#define RP2350_CLK_SYS_AUXSRC_ROSC      (2U << 5)
#define RP2350_CLK_SYS_AUXSRC_XOSC      (3U << 5)
#define RP2350_CLK_SYS_SRC_REF          (0U)
#define RP2350_CLK_SYS_SRC_AUX          (1U)

/* CLK_GPOUT0 AUXSRC values (which clock to route out the pin) */
#define RP2350_CLK_GPOUT_AUXSRC_PLL_SYS  (0U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_GPIN0    (1U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_GPIN1    (2U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_PLL_USB  (3U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_ROSC     (4U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_XOSC     (5U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_CLK_SYS  (6U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_CLK_USB  (7U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_CLK_ADC  (8U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_CLK_REF  (9U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_CLK_PERI (10U << 5)
#define RP2350_CLK_GPOUT_AUXSRC_CLK_HSTX (11U << 5)
#define RP2350_CLK_GPOUT_DC50            (1U << 12)  /* duty-cycle correction */
#define RP2350_CLK_GPOUT_KILL            (1U << 10)
#define RP2350_CLK_GPOUT_ENABLE          (1U << 11)

/* CLK_REF_CTRL fields */
#define RP2350_CLK_REF_SRC_ROSC         (0U)
#define RP2350_CLK_REF_SRC_AUX          (1U)
#define RP2350_CLK_REF_SRC_XOSC         (2U)
#define RP2350_CLK_REF_AUXSRC_PLL_USB   (0U << 5)
#define RP2350_CLK_REF_AUXSRC_ROSC      (1U << 5)

/* CLK_PERI_CTRL fields */
#define RP2350_CLK_PERI_ENABLE          (1U << 11)
#define RP2350_CLK_PERI_AUXSRC_CLK_SYS  (0U << 5)
#define RP2350_CLK_PERI_AUXSRC_PLL_SYS  (1U << 5)
#define RP2350_CLK_PERI_AUXSRC_PLL_USB  (2U << 5)
#define RP2350_CLK_PERI_AUXSRC_ROSC     (3U << 5)
#define RP2350_CLK_PERI_AUXSRC_XOSC     (4U << 5)

/*---------------------------------------------------------------------------*/
/* XOSC                                                                      */
/*---------------------------------------------------------------------------*/

/**
 * @brief Crystal oscillator (XOSC) — 12 MHz reference (datasheet §5.3).
 *
 * Enable by writing 0xFAB000 to CTRL (with the 1-15 MHz range code
 * 0xAA0 in the low field); disable with 0xD1E000.  Poll
 * XOSC_STATUS.STABLE (bit 31) before switching CLK_SYS to use it.
 */
#define RP2350_XOSC_CTRL            (RP2350_XOSC_BASE + 0x00U)
#define RP2350_XOSC_STATUS          (RP2350_XOSC_BASE + 0x04U)
#define RP2350_XOSC_DORMANT         (RP2350_XOSC_BASE + 0x08U)
#define RP2350_XOSC_STARTUP         (RP2350_XOSC_BASE + 0x0CU)

/* XOSC_CTRL: enable + freq range. The 0xFAB code is the "enable"
 * magic; 0xD1E disables; 0xAA0 marks the 1-15 MHz range. */
#define RP2350_XOSC_CTRL_ENABLE     (0xFAB000U)
#define RP2350_XOSC_CTRL_DISABLE    (0xD1E000U)
#define RP2350_XOSC_CTRL_FREQ_1_15  (0xAA0U)
#define RP2350_XOSC_STATUS_STABLE   (1U << 31)

/*---------------------------------------------------------------------------*/
/* PLL                                                                       */
/*---------------------------------------------------------------------------*/

/*
 * PLL_SYS and PLL_USB register offsets (datasheet §5.4).
 *
 * Offsets are relative to the respective PLL base address
 * (RP2350_PLL_SYS_BASE or RP2350_PLL_USB_BASE).  The lock sequence:
 * write FBDIV_INT, clear PD/VCOPD/DSMPD in PWR, poll CS.LOCK, then
 * clear POSTDIVPD and write PRIM post-dividers.
 */
#define RP2350_PLL_CS               (0x00U)
#define RP2350_PLL_PWR              (0x04U)
#define RP2350_PLL_FBDIV_INT        (0x08U)
#define RP2350_PLL_PRIM             (0x0CU)

#define RP2350_PLL_CS_LOCK          (1U << 31)
#define RP2350_PLL_CS_REFDIV_MASK   (0x3FU)
#define RP2350_PLL_PWR_PD           (1U <<  0)  /* main pwr down */
#define RP2350_PLL_PWR_DSMPD        (1U <<  2)  /* DSM pwr down */
#define RP2350_PLL_PWR_POSTDIVPD    (1U <<  3)  /* post divider pwr down */
#define RP2350_PLL_PWR_VCOPD        (1U <<  5)  /* VCO pwr down */
#define RP2350_PLL_PRIM_POSTDIV1_S  16
#define RP2350_PLL_PRIM_POSTDIV2_S  12

