tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
/*---------------------------------------------------------------------------*/
/* IO_BANK0 (per-pin function select + interrupt config)                     */
/*---------------------------------------------------------------------------*/

/*
 * IO_BANK0 — GPIO function select and interrupt config (datasheet §9).
 *
 * Each of the 48 GPIO pins has an 8-byte block (STATUS + CTRL).
 * GPIOn_CTRL.FUNCSEL (low 5 bits) routes the pin to a peripheral;
 * RP2350_IO_FUNC_* constants give the valid values.  The interrupt
 * arrays (INTR / PROC0_INTE / PROC0_INTF / PROC0_INTS) each cover
 * 8 pins per 32-bit word with 4 bits per pin (level-low / level-high /
 * edge-low / edge-high).
 */
/* Per-pin block: 8 bytes (STATUS + CTRL) at offset 0x000..0x100 for
 * pins 0..31. CTRL offset for pin n = 0x004 + n*8. */
#define RP2350_IO_BANK0_GPIO_CTRL(n) (RP2350_IO_BANK0_BASE + 0x004U + ((n) * 8U))

/* Function-select values written into GPIOn_CTRL.FUNCSEL (low 5 bits) */
#define RP2350_IO_FUNC_HSTX         0
#define RP2350_IO_FUNC_SPI          1
#define RP2350_IO_FUNC_UART         2
#define RP2350_IO_FUNC_I2C          3
#define RP2350_IO_FUNC_PWM          4
#define RP2350_IO_FUNC_SIO          5  /* GPIO via SIO */
#define RP2350_IO_FUNC_PIO0         6
#define RP2350_IO_FUNC_PIO1         7
#define RP2350_IO_FUNC_PIO2         8
#define RP2350_IO_FUNC_GPCK         9  /* clock gpin */
#define RP2350_IO_FUNC_USB          10
#define RP2350_IO_FUNC_UART_AUX     11
#define RP2350_IO_FUNC_NULL         31

/* PROC0 IRQ enable / status arrays. Each register covers 8 pins
 * (4 bits per pin: LEVEL_LOW / LEVEL_HIGH / EDGE_LOW / EDGE_HIGH). */
#define RP2350_IO_BANK0_INTR(i)         (RP2350_IO_BANK0_BASE + 0x230U + ((i) * 4U))
#define RP2350_IO_BANK0_PROC0_INTE(i)   (RP2350_IO_BANK0_BASE + 0x270U + ((i) * 4U))
#define RP2350_IO_BANK0_PROC0_INTF(i)   (RP2350_IO_BANK0_BASE + 0x2B0U + ((i) * 4U))
#define RP2350_IO_BANK0_PROC0_INTS(i)   (RP2350_IO_BANK0_BASE + 0x2F0U + ((i) * 4U))

#define RP2350_IO_INT_LEVEL_LOW     0x1U
#define RP2350_IO_INT_LEVEL_HIGH    0x2U
#define RP2350_IO_INT_EDGE_LOW      0x4U
#define RP2350_IO_INT_EDGE_HIGH     0x8U

/*---------------------------------------------------------------------------*/
/* PADS_BANK0 (drive strength, pull, schmitt)                                */
/*---------------------------------------------------------------------------*/

/*
 * PADS_BANK0 — pad electrical properties (datasheet §9.3).
 *
 * Each GPIO pad has one 32-bit register controlling output-disable (OD),
 * input-enable (IE), drive strength (2/4/8/12 mA), pull-up (PUE),
 * pull-down (PDE), Schmitt trigger (SCHMITT), and slew rate (SLEWFAST).
 * The ISO bit must be cleared after RESETS to enable I/O on the pad.
 */
#define RP2350_PADS_BANK0_VOLTAGE   (RP2350_PADS_BANK0_BASE + 0x00U)
#define RP2350_PADS_BANK0_GPIO(n)   (RP2350_PADS_BANK0_BASE + 0x04U + ((n) * 4U))

#define RP2350_PADS_OD              (1U << 7)  /* output disable */
#define RP2350_PADS_IE              (1U << 6)  /* input enable */
#define RP2350_PADS_DRIVE_2MA       (0U << 4)
#define RP2350_PADS_DRIVE_4MA       (1U << 4)
#define RP2350_PADS_DRIVE_8MA       (2U << 4)
#define RP2350_PADS_DRIVE_12MA      (3U << 4)
#define RP2350_PADS_PUE             (1U << 3)  /* pull-up enable */
#define RP2350_PADS_PDE             (1U << 2)  /* pull-down enable */
#define RP2350_PADS_SCHMITT         (1U << 1)
#define RP2350_PADS_SLEWFAST        (1U << 0)

/* Pads-bank0 ISO bit (must be cleared after RESETS to enable I/O) */
#define RP2350_PADS_ISO             (1U << 8)

/*---------------------------------------------------------------------------*/
/* SIO (Single-cycle I/O for fast GPIO)                                      */
/*---------------------------------------------------------------------------*/

/*
 * SIO — single-cycle GPIO data registers (datasheet §3.1.5).
 *
 * SIO is the fast GPIO path: reads and writes complete in one CPU cycle.
 * Dedicated *_SET / *_CLR / *_XOR registers avoid the read-modify-write
 * race without needing the RP2350_REG_ALIAS_* atomic aliases — note that
 * SIO does NOT respond to the +0x2000/+0x3000 alias scheme.
 * Pins 0..29 appear in the low bank (GPIO_IN/OUT/OE); pins 30..47
 * appear in the high bank (GPIO_HI_IN/OUT).
 */
#define RP2350_SIO_GPIO_IN          (RP2350_SIO_BASE + 0x004U)
#define RP2350_SIO_GPIO_OUT         (RP2350_SIO_BASE + 0x010U)
#define RP2350_SIO_GPIO_OUT_SET     (RP2350_SIO_BASE + 0x018U)
#define RP2350_SIO_GPIO_OUT_CLR     (RP2350_SIO_BASE + 0x020U)
#define RP2350_SIO_GPIO_OUT_XOR     (RP2350_SIO_BASE + 0x028U)
#define RP2350_SIO_GPIO_OE          (RP2350_SIO_BASE + 0x030U)
#define RP2350_SIO_GPIO_OE_SET      (RP2350_SIO_BASE + 0x038U)
#define RP2350_SIO_GPIO_OE_CLR      (RP2350_SIO_BASE + 0x040U)

/* High GPIO bank (pins 32..47): not exposed via VFS, but
 * declare the addresses for completeness. */
#define RP2350_SIO_GPIO_HI_IN       (RP2350_SIO_BASE + 0x008U)
#define RP2350_SIO_GPIO_HI_OUT      (RP2350_SIO_BASE + 0x014U)

/*---------------------------------------------------------------------------*/
/* UART (PrimeCell PL011)                                                    */
/*---------------------------------------------------------------------------*/

/*
 * UART0/UART1 — PrimeCell PL011 registers (datasheet §12.2).
 *
 * Offsets are relative to RP2350_UART0_BASE or RP2350_UART1_BASE.
 * The PL011 register layout is identical on both blocks and matches
 * the ARM PrimeCell UART (PL011) TRM.  DR holds the 8-bit data byte
 * plus 4 RX error flags in the upper nibble.  FR reflects TX/RX FIFO
 * fill state and the BUSY bit.  Baud is set via the IBRD/FBRD pair:
 * baud_divisor = clk_peri / (16 * baud).
 */
#define RP2350_UART_DR              (0x000U)  /* data */
#define RP2350_UART_RSR             (0x004U)  /* receive status / error clear */
#define RP2350_UART_FR              (0x018U)  /* flag */
#define RP2350_UART_IBRD            (0x024U)  /* integer baud-rate */
#define RP2350_UART_FBRD            (0x028U)  /* fractional baud-rate */
#define RP2350_UART_LCR_H           (0x02CU)  /* line control */
#define RP2350_UART_CR              (0x030U)  /* control */
#define RP2350_UART_IFLS            (0x034U)  /* IFIFO level select */
#define RP2350_UART_IMSC            (0x038U)  /* interrupt mask */
#define RP2350_UART_RIS             (0x03CU)  /* raw interrupt status */
#define RP2350_UART_MIS             (0x040U)  /* masked interrupt status */
#define RP2350_UART_ICR             (0x044U)  /* interrupt clear */
#define RP2350_UART_DMACR           (0x048U)

/* DR upper byte holds RX error flags (FE/PE/BE/OE) */
#define RP2350_UART_DR_OE           (1U << 11)
#define RP2350_UART_DR_BE           (1U << 10)
#define RP2350_UART_DR_PE           (1U <<  9)
#define RP2350_UART_DR_FE           (1U <<  8)

/* FR (flag) */
#define RP2350_UART_FR_TXFE         (1U <<  7)  /* TX FIFO empty */
#define RP2350_UART_FR_RXFF         (1U <<  6)
#define RP2350_UART_FR_TXFF         (1U <<  5)
#define RP2350_UART_FR_RXFE         (1U <<  4)
#define RP2350_UART_FR_BUSY         (1U <<  3)

