tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
/* LCR_H */
#define RP2350_UART_LCR_BRK         (1U <<  0)
#define RP2350_UART_LCR_PEN         (1U <<  1)
#define RP2350_UART_LCR_EPS         (1U <<  2)
#define RP2350_UART_LCR_STP2        (1U <<  3)
#define RP2350_UART_LCR_FEN         (1U <<  4)
#define RP2350_UART_LCR_WLEN_8      (3U <<  5)
#define RP2350_UART_LCR_SPS         (1U <<  7)

/* CR */
#define RP2350_UART_CR_UARTEN       (1U <<  0)
#define RP2350_UART_CR_LBE          (1U <<  7)  /* loopback enable */
#define RP2350_UART_CR_TXE          (1U <<  8)
#define RP2350_UART_CR_RXE          (1U <<  9)

/* IMSC / MIS / ICR bits */
#define RP2350_UART_INT_RXIM        (1U <<  4)
#define RP2350_UART_INT_TXIM        (1U <<  5)
#define RP2350_UART_INT_RTIM        (1U <<  6)
#define RP2350_UART_INT_OEIM        (1U << 10)

/*---------------------------------------------------------------------------*/
/* TIMER (TIMER0)                                                            */
/*---------------------------------------------------------------------------*/

/*
 * TIMER0 — 64-bit free-running microsecond timer (datasheet §12.7).
 *
 * Clocked by the 1 us tick from the TICKS block.  TIMERAWL/TIMERAWH
 * give the raw 64-bit value without latching; TIMELR/TIMEHR use a
 * hardware latch (read L first to capture H atomically).  ALARM0..1
 * fire when the lower 32 bits of the timer match; set the ARMED bit to
 * arm.  INTR/INTE/INTF/INTS offsets on RP2350 sit 8 bytes higher than
 * on RP2040 due to the new LOCKED and SOURCE registers at 0x34/0x38.
 */
#define RP2350_TIMER0_TIMEHW        (RP2350_TIMER0_BASE + 0x00U)
#define RP2350_TIMER0_TIMELW        (RP2350_TIMER0_BASE + 0x04U)
#define RP2350_TIMER0_TIMEHR        (RP2350_TIMER0_BASE + 0x08U)
#define RP2350_TIMER0_TIMELR        (RP2350_TIMER0_BASE + 0x0CU)
#define RP2350_TIMER0_ALARM0        (RP2350_TIMER0_BASE + 0x10U)
#define RP2350_TIMER0_ALARM1        (RP2350_TIMER0_BASE + 0x14U)
#define RP2350_TIMER0_ARMED         (RP2350_TIMER0_BASE + 0x20U)
#define RP2350_TIMER0_TIMERAWH      (RP2350_TIMER0_BASE + 0x24U)
#define RP2350_TIMER0_TIMERAWL      (RP2350_TIMER0_BASE + 0x28U)
#define RP2350_TIMER0_DBGPAUSE      (RP2350_TIMER0_BASE + 0x2CU)
#define RP2350_TIMER0_PAUSE         (RP2350_TIMER0_BASE + 0x30U)
/* RP2350 inserts two new registers (LOCKED, SOURCE) at 0x34 and 0x38
 * relative to the RP2040 layout. INTR/INTE/INTF/INTS are pushed
 * forward by 8 bytes. The previous offsets here matched the RP2040
 * map only and silently mis-addressed every interrupt-related write
 * (e.g. "INTE" landed on the real INTR, "INTS" landed on INTF) —
 * symptom: ALARM0 fires and INTR latches, but the IRQ never reaches
 * the NVIC because real INTE was never enabled. Datasheet §12.7.2. */
#define RP2350_TIMER0_LOCKED        (RP2350_TIMER0_BASE + 0x34U)
#define RP2350_TIMER0_SOURCE        (RP2350_TIMER0_BASE + 0x38U)
#define RP2350_TIMER0_INTR          (RP2350_TIMER0_BASE + 0x3CU)
#define RP2350_TIMER0_INTE          (RP2350_TIMER0_BASE + 0x40U)
#define RP2350_TIMER0_INTF          (RP2350_TIMER0_BASE + 0x44U)
#define RP2350_TIMER0_INTS          (RP2350_TIMER0_BASE + 0x48U)

/*---------------------------------------------------------------------------*/
/* ADC (single 12-bit SAR — datasheet §12.4)                                 */
/*---------------------------------------------------------------------------*/

/*
 * ADC — 12-bit successive-approximation converter (datasheet §12.4).
 *
 * CS.AINSEL selects the channel (0..3 = AIN0..AIN3 on GP26..GP29;
 * channel 4 = on-chip temperature sensor).  Start a single conversion
 * with CS.START_ONCE; poll CS.READY before reading RESULT.  ADC pins
 * require OD=1 (output disable) and IE=0 in PADS_BANK0 to avoid
 * leakage into the 3.3 V signal path.
 */
#define RP2350_ADC_CS               (RP2350_ADC_BASE + 0x00U)
#define RP2350_ADC_RESULT           (RP2350_ADC_BASE + 0x04U)
#define RP2350_ADC_FCS              (RP2350_ADC_BASE + 0x08U)
#define RP2350_ADC_FIFO             (RP2350_ADC_BASE + 0x0CU)
#define RP2350_ADC_DIV              (RP2350_ADC_BASE + 0x10U)
#define RP2350_ADC_INTR             (RP2350_ADC_BASE + 0x14U)
#define RP2350_ADC_INTE             (RP2350_ADC_BASE + 0x18U)
#define RP2350_ADC_INTF             (RP2350_ADC_BASE + 0x1CU)
#define RP2350_ADC_INTS             (RP2350_ADC_BASE + 0x20U)

/* CS bits */
#define RP2350_ADC_CS_EN            (1U << 0)   /* ADC enable */
#define RP2350_ADC_CS_TS_EN         (1U << 1)   /* Temperature sensor enable */
#define RP2350_ADC_CS_START_ONCE    (1U << 2)   /* Trigger one conversion */
#define RP2350_ADC_CS_START_MANY    (1U << 3)   /* Free-running mode */
#define RP2350_ADC_CS_READY         (1U << 8)   /* 1 = idle (conversion done) */
#define RP2350_ADC_CS_ERR           (1U << 9)   /* Conversion error */
#define RP2350_ADC_CS_ERR_STICKY    (1U << 10)  /* Sticky error */
#define RP2350_ADC_CS_AINSEL_SHIFT  12          /* Channel select 0..7 */
#define RP2350_ADC_CS_AINSEL_MASK   (0xFU << RP2350_ADC_CS_AINSEL_SHIFT)

/* The temperature sensor is wired to AINSEL channel 4. ADC channels
 * 0..3 are AIN0..AIN3 (GPIO26..GPIO29 on the standard package). */
#define RP2350_ADC_CHANNEL_TEMP     4U

/* GPIO offset for ADC pin n: AIN0..AIN3 → GP26..GP29. */
#define RP2350_ADC_GPIO_BASE        26U

/*---------------------------------------------------------------------------*/
/* I2C (DW_apb_i2c — datasheet §12.3, plus the DesignWare IP databook)       */
/*---------------------------------------------------------------------------*/

/*
 * I2C0/I2C1 — DesignWare DW_apb_i2c registers (datasheet §12.3).
 *
 * Offsets are relative to RP2350_I2C0_BASE or RP2350_I2C1_BASE.
 * Master-only, 7-bit addressing.  IC_CON sets speed and role; IC_TAR
 * holds the target address; IC_DATA_CMD issues read/write commands with
 * optional STOP and RESTART bits.  SCL high/low counts (IC_SS/FS_SCL_*)
 * must be computed from clk_peri for the desired speed mode.
 */
#define RP2350_I2C_IC_CON              0x00U
#define RP2350_I2C_IC_TAR              0x04U
#define RP2350_I2C_IC_DATA_CMD         0x10U
#define RP2350_I2C_IC_SS_SCL_HCNT      0x14U
#define RP2350_I2C_IC_SS_SCL_LCNT      0x18U
#define RP2350_I2C_IC_FS_SCL_HCNT      0x1CU
#define RP2350_I2C_IC_FS_SCL_LCNT      0x20U
#define RP2350_I2C_IC_INTR_STAT        0x2CU
#define RP2350_I2C_IC_RAW_INTR_STAT    0x34U
#define RP2350_I2C_IC_CLR_INTR         0x40U
#define RP2350_I2C_IC_CLR_TX_ABRT      0x54U
#define RP2350_I2C_IC_ENABLE           0x6CU
#define RP2350_I2C_IC_STATUS           0x70U
#define RP2350_I2C_IC_TXFLR            0x74U
#define RP2350_I2C_IC_RXFLR            0x78U
#define RP2350_I2C_IC_SDA_HOLD         0x7CU
#define RP2350_I2C_IC_TX_ABRT_SOURCE   0x80U
#define RP2350_I2C_IC_ENABLE_STATUS    0x9CU
#define RP2350_I2C_IC_FS_SPKLEN        0xA8U

/* IC_CON bits */
#define RP2350_I2C_CON_MASTER          (1U << 0)
#define RP2350_I2C_CON_SPEED_SS        (1U << 1)   /* standard mode */
#define RP2350_I2C_CON_SPEED_FS        (2U << 1)   /* fast mode */
#define RP2350_I2C_CON_SLAVE_DISABLE   (1U << 6)
#define RP2350_I2C_CON_RESTART_EN      (1U << 5)
#define RP2350_I2C_CON_TX_EMPTY_CTRL   (1U << 8)

