tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
/* IC_DATA_CMD bits */
#define RP2350_I2C_DATA_CMD_READ       (1U << 8)
#define RP2350_I2C_DATA_CMD_STOP       (1U << 9)
#define RP2350_I2C_DATA_CMD_RESTART    (1U << 10)

/* IC_STATUS bits */
#define RP2350_I2C_STATUS_ACTIVITY     (1U << 0)
#define RP2350_I2C_STATUS_TFNF         (1U << 1)   /* TX FIFO not full */
#define RP2350_I2C_STATUS_TFE          (1U << 2)   /* TX FIFO empty */
#define RP2350_I2C_STATUS_RFNE         (1U << 3)   /* RX FIFO not empty */

/* IC_RAW_INTR_STAT bits used by the driver */
#define RP2350_I2C_INTR_TX_ABRT        (1U << 6)
#define RP2350_I2C_INTR_STOP_DET       (1U << 9)

/* IC_TX_ABRT_SOURCE bits commonly observed (NACK on address / data). */
#define RP2350_I2C_ABRT_7B_ADDR_NOACK  (1U << 0)
#define RP2350_I2C_ABRT_TXDATA_NOACK   (1U << 3)

/*---------------------------------------------------------------------------*/
/* SPI (PL022 — datasheet §12.5)                                             */
/*---------------------------------------------------------------------------*/

/*
 * SPI0/SPI1 — PrimeCell PL022 SSP registers (datasheet §12.5).
 *
 * Offsets are relative to RP2350_SPI0_BASE or RP2350_SPI1_BASE.
 * Configure 8-bit Motorola format via SSPCR0; set baud via SSPCPSR
 * (pre-scaler, must be even 2..254) and SSPCR0.SCR (rate 0..255);
 * enable with SSPCR1.SSE.  SSPDR is both TX write and RX read.
 * SSPSR reflects TX/RX FIFO fill state and the BUSY bit.
 */
#define RP2350_SPI_SSPCR0              0x00U
#define RP2350_SPI_SSPCR1              0x04U
#define RP2350_SPI_SSPDR               0x08U
#define RP2350_SPI_SSPSR               0x0CU
#define RP2350_SPI_SSPCPSR             0x10U

/* SSPCR0 fields */
#define RP2350_SPI_CR0_DSS_8BIT        0x07U                /* bits[3:0] */
#define RP2350_SPI_CR0_FRF_MOTOROLA    (0U << 4)
#define RP2350_SPI_CR0_SPO             (1U << 6)            /* CPOL */
#define RP2350_SPI_CR0_SPH             (1U << 7)            /* CPHA */
#define RP2350_SPI_CR0_SCR_SHIFT       8                    /* serial clock rate, bits[15:8] */

/* SSPCR1 fields */
#define RP2350_SPI_CR1_SSE             (1U << 1)            /* enable */
#define RP2350_SPI_CR1_MS              (1U << 2)            /* 0 = master */

/* SSPSR (status) */
#define RP2350_SPI_SR_TFE              (1U << 0)            /* TX FIFO empty */
#define RP2350_SPI_SR_TNF              (1U << 1)            /* TX FIFO not full */
#define RP2350_SPI_SR_RNE              (1U << 2)            /* RX FIFO not empty */
#define RP2350_SPI_SR_RFF              (1U << 3)            /* RX FIFO full */
#define RP2350_SPI_SR_BSY              (1U << 4)            /* busy */

/*---------------------------------------------------------------------------*/
/* WATCHDOG                                                                  */
/*---------------------------------------------------------------------------*/

/*
 * Watchdog timer registers (datasheet §13).
 *
 * CTRL.ENABLE arms the watchdog; CTRL.TRIGGER forces an immediate reset.
 * LOAD sets the down-count reload value (in 2 us ticks from the TICKS
 * block).  REASON distinguishes watchdog resets from other reset causes.
 * SCRATCH0 survives a watchdog reset and is used by the boot sequence
 * to detect warm-reset loops.  WD_TICK must point to the TICKS block
 * watchdog entry, not the old TICKS_BASE offset used on RP2040.
 */
#define RP2350_WD_CTRL              (RP2350_WATCHDOG_BASE + 0x00U)
#define RP2350_WD_LOAD              (RP2350_WATCHDOG_BASE + 0x04U)
#define RP2350_WD_REASON            (RP2350_WATCHDOG_BASE + 0x08U)
#define RP2350_WD_SCRATCH0          (RP2350_WATCHDOG_BASE + 0x0CU)
#define RP2350_WD_TICK              (RP2350_TICKS_BASE   + 0x18U)  /* watchdog tick on TICKS block */

#define RP2350_WD_CTRL_TIME_MASK    (0xFFFFFFU)
#define RP2350_WD_CTRL_PAUSE_DBG1   (1U << 25)
#define RP2350_WD_CTRL_PAUSE_DBG0   (1U << 26)
#define RP2350_WD_CTRL_PAUSE_JTAG   (1U << 24)
#define RP2350_WD_CTRL_ENABLE       (1U << 30)
#define RP2350_WD_CTRL_TRIGGER      (1U << 31)

/*---------------------------------------------------------------------------*/
/* TICKS BLOCK (per-block tick generators on RP2350 — datasheet §10.6)       */
/*---------------------------------------------------------------------------*/

/*
 * TICKS block — per-subsystem 1 us tick generators (datasheet §10.6).
 *
 * The RP2350 TICKS block provides nine independently-controllable tick
 * generators (PROC0, PROC1, TIMER0, TIMER1, WATCHDOG, and four more).
 * Each generator takes the reference clock and divides it: write
 * CYCLES = clk_ref_MHz - 1 (e.g. 11 for 12 MHz XOSC) then set
 * CTRL.ENABLE.  TIMER0 needs its own tick to produce the 64-bit 1 us
 * free-running counter; the WATCHDOG generator drives the watchdog
 * down-counter.
 */
#define RP2350_TICKS_PROC0_CTRL     (RP2350_TICKS_BASE + 0x00U)
#define RP2350_TICKS_PROC0_CYCLES   (RP2350_TICKS_BASE + 0x04U)
#define RP2350_TICKS_PROC0_COUNT    (RP2350_TICKS_BASE + 0x08U)
#define RP2350_TICKS_PROC1_CTRL     (RP2350_TICKS_BASE + 0x0CU)
#define RP2350_TICKS_PROC1_CYCLES   (RP2350_TICKS_BASE + 0x10U)
#define RP2350_TICKS_TIMER0_CTRL    (RP2350_TICKS_BASE + 0x18U)
#define RP2350_TICKS_TIMER0_CYCLES  (RP2350_TICKS_BASE + 0x1CU)
#define RP2350_TICKS_TIMER1_CTRL    (RP2350_TICKS_BASE + 0x24U)
#define RP2350_TICKS_TIMER1_CYCLES  (RP2350_TICKS_BASE + 0x28U)
#define RP2350_TICKS_WATCHDOG_CTRL  (RP2350_TICKS_BASE + 0x30U)
#define RP2350_TICKS_WATCHDOG_CYCLES (RP2350_TICKS_BASE + 0x34U)

#define RP2350_TICK_ENABLE          (1U << 0)
#define RP2350_TICK_RUNNING         (1U << 1)

/*---------------------------------------------------------------------------*/
/* SysTick (Cortex-M)                                                        */
/*---------------------------------------------------------------------------*/

/*
 * Cortex-M33 SysTick registers (ARMv8-M TRM §B3.3).
 *
 * CSR controls the timer (ENABLE, TICKINT to fire SysTick exception,
 * CLKSRC selects processor vs. reference clock).  RVR is the 24-bit
 * reload value; CVR is the current down-count (write-any to clear).
 * TikuOS sets CLKSRC = 1 (processor clock) and reloads for
 * TIKU_CLOCK_ARCH_INTERVAL cycles to achieve 128 Hz tick.
 */
#define RP2350_SYST_CSR             (RP2350_SYST_BASE + 0x00U)
#define RP2350_SYST_RVR             (RP2350_SYST_BASE + 0x04U)
#define RP2350_SYST_CVR             (RP2350_SYST_BASE + 0x08U)
#define RP2350_SYST_CALIB           (RP2350_SYST_BASE + 0x0CU)

