tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
#define RP2350_SYST_CSR_ENABLE      (1U << 0)
#define RP2350_SYST_CSR_TICKINT     (1U << 1)
#define RP2350_SYST_CSR_CLKSRC_CPU  (1U << 2)  /* 1 = processor clock */
#define RP2350_SYST_CSR_COUNTFLAG   (1U << 16)

/*---------------------------------------------------------------------------*/
/* NVIC (basic ISER/ICER/ISPR/ICPR layout, indexed by IRQ number)           */
/*---------------------------------------------------------------------------*/

/*
 * Cortex-M33 NVIC registers (ARMv8-M TRM §B3.4).
 *
 * ISER0/ICER0 enable/disable IRQs by setting a bit at position irq%32
 * in the word at base + (irq/32)*4.  ISPR/ICPR set and clear pending
 * state.  IPR0 holds four 8-bit priority bytes per word; TikuOS uses
 * the rp2350_nvic_enable/disable/clear_pending inline helpers rather
 * than direct macro access.
 */
#define RP2350_NVIC_ISER0           (RP2350_NVIC_BASE + 0x000U)
#define RP2350_NVIC_ICER0           (RP2350_NVIC_BASE + 0x080U)
#define RP2350_NVIC_ISPR0           (RP2350_NVIC_BASE + 0x100U)
#define RP2350_NVIC_ICPR0           (RP2350_NVIC_BASE + 0x180U)
#define RP2350_NVIC_IPR0            (RP2350_NVIC_BASE + 0x300U)

/*---------------------------------------------------------------------------*/
/* SCB (System Control Block) — Cortex-M33                                   */
/*---------------------------------------------------------------------------*/

/*
 * SCB — System Control Block registers (ARMv8-M TRM §B3.2).
 *
 * AIRCR.SYSRESET (with VECTKEY = 0x05FA) triggers a warm system reset.
 * SHCSR.MEMFAULTENA enables the MemManage fault handler; without it,
 * all MemManage faults escalate to HardFault.  CFSR.MMFSR (low byte)
 * reports the fault type; MMFAR holds the faulting address when
 * MMARVALID is set.
 */
#define RP2350_SCB_AIRCR            (RP2350_SCB_BASE + 0x0CU)  /* App IRQ + reset control */
#define RP2350_SCB_SHCSR            (RP2350_SCB_BASE + 0x24U)  /* System Handler CSR */
#define RP2350_SCB_CFSR             (RP2350_SCB_BASE + 0x28U)  /* Configurable Fault Status */
#define RP2350_SCB_HFSR             (RP2350_SCB_BASE + 0x2CU)  /* HardFault Status */
#define RP2350_SCB_MMFAR            (RP2350_SCB_BASE + 0x34U)  /* MemManage Fault Address */

#define RP2350_SCB_AIRCR_VECTKEY    (0x05FAUL << 16)
#define RP2350_SCB_AIRCR_SYSRESET   (1U << 2)
#define RP2350_SCB_SHCSR_MEMFAULTENA (1U << 16)

/* CFSR.MMFSR (low byte) — write 1 to clear */
#define RP2350_SCB_MMFSR_IACCVIOL   (1U << 0)
#define RP2350_SCB_MMFSR_DACCVIOL   (1U << 1)
#define RP2350_SCB_MMFSR_MUNSTKERR  (1U << 3)
#define RP2350_SCB_MMFSR_MSTKERR    (1U << 4)
#define RP2350_SCB_MMFSR_MMARVALID  (1U << 7)

/*---------------------------------------------------------------------------*/
/* MPU — ARMv8-M (Cortex-M33)                                                */
/*---------------------------------------------------------------------------*/

/*
 * ARMv8-M MPU registers (ARMv8-M TRM §B3.5).
 *
 * The Cortex-M33 MPU supports up to 8 regions (TYPE.DREGION = 8 on
 * RP2350).  Each region is configured by writing RNR (select), then
 * RBAR (base + attributes) and RLAR (limit + enable).  AP bits in
 * RBAR control read/write/execute permission; XN (bit 0) marks a region
 * as Execute-Never.  MAIR0/MAIR1 hold memory type attributes (one byte
 * per AttrIndx 0..7); MAIR_NORMAL_NC (0x44) configures Normal,
 * Non-cacheable memory, which is appropriate for SRAM regions.
 */
#define RP2350_MPU_TYPE             (RP2350_MPU_BASE + 0x00U)  /* read DREGION count */
#define RP2350_MPU_CTRL             (RP2350_MPU_BASE + 0x04U)
#define RP2350_MPU_RNR              (RP2350_MPU_BASE + 0x08U)
#define RP2350_MPU_RBAR             (RP2350_MPU_BASE + 0x0CU)
#define RP2350_MPU_RLAR             (RP2350_MPU_BASE + 0x10U)
#define RP2350_MPU_MAIR0            (RP2350_MPU_BASE + 0x30U)
#define RP2350_MPU_MAIR1            (RP2350_MPU_BASE + 0x34U)

/* MPU_CTRL */
#define RP2350_MPU_CTRL_ENABLE      (1U << 0)
#define RP2350_MPU_CTRL_HFNMIENA    (1U << 1)
#define RP2350_MPU_CTRL_PRIVDEFENA  (1U << 2)

/* RBAR fields (ARMv8-M):
 *   bits[31:5]  BASE          (32-byte aligned)
 *   bits[ 4:3]  SH            (sharability — 00 = Non-shareable for normal mem)
 *   bits[ 2:1]  AP            (00 RW priv-only, 01 RW any, 10 RO priv-only, 11 RO any)
 *   bit       0  XN            (1 = Execute Never)
 *
 * RLAR fields:
 *   bits[31:5]  LIMIT         (32-byte aligned, inclusive)
 *   bits[ 4:1]  AttrIndx      (index into MPU_MAIR{0,1})
 *   bit       0  EN            (region enable) */
#define RP2350_MPU_RBAR_AP_RW_ANY   (0x1U << 1)
#define RP2350_MPU_RBAR_AP_RO_ANY   (0x3U << 1)
#define RP2350_MPU_RBAR_XN          (1U << 0)
#define RP2350_MPU_RBAR_AP_MASK     (0x3U << 1)
#define RP2350_MPU_RLAR_EN          (1U << 0)

/* MPU_MAIR memory attribute encodings (one byte per attr index 0..3 in MAIR0,
 * 4..7 in MAIR1). 0x44 = Normal, Inner & Outer Non-cacheable — fine for
 * SRAM, needing no cache coherence guarantees beyond the Cortex-M33
 * default MPU semantics. */
#define RP2350_MPU_MAIR_NORMAL_NC   0x44U

/*---------------------------------------------------------------------------*/
/* PWM (Pulse Width Modulator) — RP2350 datasheet §12.7                      */
/*---------------------------------------------------------------------------*/

/*
 * PWM block — 12 slices, 2 channels each (datasheet §12.7).
 *
 * Per-slice registers stride 0x14 bytes from PWM_BASE.  Slice for GPIO n
 * is (n/2)%12; channel is n%2 (A=even, B=odd).  TOP sets the wrap value
 * (default 65535 for 16-bit duty resolution); DIV.INT/FRAC divides
 * clk_sys to reach the desired wrap frequency.  The inline helpers
 * rp2350_pwm_pin_to_slice() and rp2350_pwm_pin_to_channel() perform
 * the mapping at zero cost in optimised builds.
 */
/* 12 slices, each with 2 channels (A and B). Per-slice registers live at
 * a 0x14-byte stride starting at PWM_BASE. Slice for GPIO n is
 * (n / 2) % 12; channel is n % 2 (A or B). Channel A occupies the low
 * 16 bits of CC, channel B the high 16. */

#define RP2350_PWM_NUM_SLICES        12U
#define RP2350_PWM_SLICE(s)          (RP2350_PWM_BASE + 0x14U * (s))
#define RP2350_PWM_SLICE_CSR(s)      (RP2350_PWM_SLICE(s) + 0x00U)
#define RP2350_PWM_SLICE_DIV(s)      (RP2350_PWM_SLICE(s) + 0x04U)
#define RP2350_PWM_SLICE_CTR(s)      (RP2350_PWM_SLICE(s) + 0x08U)
#define RP2350_PWM_SLICE_CC(s)       (RP2350_PWM_SLICE(s) + 0x0CU)
#define RP2350_PWM_SLICE_TOP(s)      (RP2350_PWM_SLICE(s) + 0x10U)

#define RP2350_PWM_EN                (RP2350_PWM_BASE + 0xF0U)  /* global SM enable */
#define RP2350_PWM_INTR              (RP2350_PWM_BASE + 0xF4U)  /* raw wrap IRQs */
#define RP2350_PWM_INTE              (RP2350_PWM_BASE + 0xF8U)  /* enable */
#define RP2350_PWM_INTF              (RP2350_PWM_BASE + 0xFCU)  /* force */
#define RP2350_PWM_INTS              (RP2350_PWM_BASE + 0x100U) /* status */

