tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
/* CSR bit fields */
#define RP2350_PWM_CSR_EN            (1U << 0)
#define RP2350_PWM_CSR_PH_CORRECT    (1U << 1)
#define RP2350_PWM_CSR_A_INV         (1U << 2)
#define RP2350_PWM_CSR_B_INV         (1U << 3)
#define RP2350_PWM_CSR_DIVMODE_FREE  (0U << 4)   /* free-running (default) */
#define RP2350_PWM_CSR_PH_ADV        (1U << 6)
#define RP2350_PWM_CSR_PH_RET        (1U << 7)

/**
 * @brief Map a GPIO pin number to its PWM slice index.
 *
 * @param gpio  GPIO pin (0..47).
 * @return Slice index (0..11).
 */
static inline uint8_t rp2350_pwm_pin_to_slice(uint8_t gpio) {
    return (uint8_t)((gpio / 2U) % RP2350_PWM_NUM_SLICES);
}

/**
 * @brief Map a GPIO pin number to its PWM channel within the slice.
 *
 * @param gpio  GPIO pin (0..47).
 * @return 0 for channel A (even pins), 1 for channel B (odd pins).
 */
static inline uint8_t rp2350_pwm_pin_to_channel(uint8_t gpio) {
    return (uint8_t)(gpio & 1U);
}

/*---------------------------------------------------------------------------*/
/* DMA — RP2350 datasheet §12.6                                              */
/*---------------------------------------------------------------------------*/

/*
 * DMA controller — 16 channels (datasheet §12.6).
 *
 * Each channel has READ_ADDR, WRITE_ADDR, TRANS_COUNT, and CTRL_TRIG
 * at a 0x40-byte stride from DMA_BASE.  Writing CTRL_TRIG starts the
 * transfer as a side-effect; CTRL is the same field without the trigger.
 * CTRL_TRIG field positions on RP2350 differ from RP2040 — INCR_READ_REV
 * (bit 5) and INCR_WRITE_REV (bit 7) were inserted, shifting RING_SIZE,
 * CHAIN_TO, TREQ_SEL, and later fields by one or two positions.  Do NOT
 * port CTRL bit positions from RP2040 reference code.
 */
/* 16 channels, each with READ_ADDR, WRITE_ADDR, TRANS_COUNT, CTRL_TRIG at
 * 0x40-byte stride. Two trigger flavours: CTRL_TRIG starts the transfer
 * on write (the standard "go" register), CTRL is the same field without
 * the start side-effect. */

#define RP2350_DMA_NUM_CHANNELS      16U
#define RP2350_DMA_CHAN(c)           (RP2350_DMA_BASE + 0x40U * (c))
#define RP2350_DMA_CHAN_READ_ADDR(c)    (RP2350_DMA_CHAN(c) + 0x00U)
#define RP2350_DMA_CHAN_WRITE_ADDR(c)   (RP2350_DMA_CHAN(c) + 0x04U)
#define RP2350_DMA_CHAN_TRANS_COUNT(c)  (RP2350_DMA_CHAN(c) + 0x08U)
#define RP2350_DMA_CHAN_CTRL_TRIG(c)    (RP2350_DMA_CHAN(c) + 0x0CU)

#define RP2350_DMA_INTR              (RP2350_DMA_BASE + 0x400U) /* raw */
#define RP2350_DMA_INTE0             (RP2350_DMA_BASE + 0x404U) /* enable for IRQ0 */
#define RP2350_DMA_INTF0             (RP2350_DMA_BASE + 0x408U)
#define RP2350_DMA_INTS0             (RP2350_DMA_BASE + 0x40CU) /* status post-enable */

/* CTRL_TRIG fields (datasheet §12.6.7.4). RP2350 inserts
 * INCR_READ_REV (bit 5) and INCR_WRITE_REV (bit 7) compared to
 * the RP2040 layout, shifting every following field by one or two
 * bits. Do NOT copy these positions from RP2040 reference code --
 * I did exactly that on the first cut and the channel sat in an
 * unsatisfiable DREQ wait forever. */
#define RP2350_DMA_CTRL_EN              (1U << 0)
#define RP2350_DMA_CTRL_HIGH_PRIO       (1U << 1)
#define RP2350_DMA_CTRL_DATA_SIZE_BYTE  (0U << 2)
#define RP2350_DMA_CTRL_DATA_SIZE_HALF  (1U << 2)
#define RP2350_DMA_CTRL_DATA_SIZE_WORD  (2U << 2)
#define RP2350_DMA_CTRL_INCR_READ       (1U << 4)
#define RP2350_DMA_CTRL_INCR_READ_REV   (1U << 5)
#define RP2350_DMA_CTRL_INCR_WRITE      (1U << 6)
#define RP2350_DMA_CTRL_INCR_WRITE_REV  (1U << 7)
#define RP2350_DMA_CTRL_RING_SHIFT       8           /* RING_SIZE field [11:8] */
#define RP2350_DMA_CTRL_RING_SEL_WR     (1U << 12)
#define RP2350_DMA_CTRL_CHAIN_TO_SHIFT  13           /* CHAIN_TO field [16:13] */
#define RP2350_DMA_CTRL_TREQ_SEL_SHIFT  17           /* TREQ_SEL field [22:17] */
#define RP2350_DMA_CTRL_TREQ_PERMANENT  0x3FU        /* unpaced (m2m) */
#define RP2350_DMA_CTRL_IRQ_QUIET       (1U << 23)
#define RP2350_DMA_CTRL_BSWAP           (1U << 24)
#define RP2350_DMA_CTRL_SNIFF_EN        (1U << 25)
#define RP2350_DMA_CTRL_WRITE_ERROR     (1U << 28)
#define RP2350_DMA_CTRL_READ_ERROR      (1U << 29)
#define RP2350_DMA_CTRL_BUSY            (1U << 30)   /* RO */
#define RP2350_DMA_CTRL_AHB_ERR         (1U << 31)   /* RO */

/*---------------------------------------------------------------------------*/
/* PIO (Programmable I/O) — RP2350 datasheet §11                             */
/*---------------------------------------------------------------------------*/

/*
 * PIO blocks PIO0/PIO1/PIO2 — registers and bit fields (datasheet §11).
 *
 * Three identical PIO blocks; each has four state machines (SM0..SM3)
 * sharing 32 instruction-memory slots and 4-deep TX/RX FIFOs.  All
 * offsets below are relative to the block base (RP2350_PIO0/1/2_BASE).
 *
 * IRQ subsystem note: RP2350 inserts SM4..SM7 control blocks between
 * SM3_PINCTRL (0x128) and the IRQ registers, pushing IRQ0_INTE from
 * the RP2040 value to 0x170.  Using RP2040 offsets here silently writes
 * the IRQ-enable bit to a reserved register; the SM fires its program
 * but no interrupt reaches the NVIC.  Always use the RP2350 offsets
 * defined below.
 */

#define RP2350_PIO_CTRL              0x000U   /* SM enable, restart */
#define RP2350_PIO_FSTAT             0x004U   /* FIFO status         */
#define RP2350_PIO_FDEBUG            0x008U   /* FIFO underflow / oflow */
#define RP2350_PIO_FLEVEL            0x00CU   /* FIFO fill levels    */
#define RP2350_PIO_TXF(sm)           (0x010U + 4U * (sm))   /* TX FIFO */
#define RP2350_PIO_RXF(sm)           (0x020U + 4U * (sm))   /* RX FIFO */
#define RP2350_PIO_IRQ               0x030U   /* PIO IRQ status (W1C) */
#define RP2350_PIO_INPUT_SYNC_BYPASS 0x038U   /* bypass input sync per GPIO */
#define RP2350_PIO_INSTR_MEM(i)      (0x048U + 4U * (i))    /* program slot */
#define RP2350_PIO_SM_CLKDIV(sm)     (0x0C8U + 0x18U * (sm))
#define RP2350_PIO_SM_EXECCTRL(sm)   (0x0CCU + 0x18U * (sm))
#define RP2350_PIO_SM_SHIFTCTRL(sm)  (0x0D0U + 0x18U * (sm))
#define RP2350_PIO_SM_ADDR(sm)       (0x0D4U + 0x18U * (sm))   /* RO */
#define RP2350_PIO_SM_INSTR(sm)      (0x0D8U + 0x18U * (sm))   /* WO: exec */
#define RP2350_PIO_SM_PINCTRL(sm)    (0x0DCU + 0x18U * (sm))

