tikuos/tikuOS/arch/arm-rp2350/tiku_rp2350_regs.h
/* PIO interrupt subsystem (two outputs per block, IRQ0 and IRQ1).
 *
 * RP2350 inserts new SM4..SM7 control blocks between RP2040's last
 * SM3_PINCTRL (0x128) and the IRQ subsystem; the IRQ0/IRQ1 offsets
 * therefore sit 0x44 bytes higher than RP2040. Authoritative source:
 * pico-sdk/src/rp2350/hardware_regs/include/hardware/regs/pio.h
 * (PIO_IRQ0_INTE_OFFSET = 0x170 etc.). Using the RP2040 offsets here
 * silently wrote the IRQ-enable bit to an unrelated reserved register;
 * the PIO state machine ran its program but no interrupt ever
 * reached the CPU and the bitbang completion path stalled. */
#define RP2350_PIO_INTR              0x16CU   /* raw IRQ source bits  */
#define RP2350_PIO_IRQ0_INTE         0x170U   /* enable               */
#define RP2350_PIO_IRQ0_INTF         0x174U   /* force                */
#define RP2350_PIO_IRQ0_INTS         0x178U   /* status (after enable) */
#define RP2350_PIO_IRQ1_INTE         0x17CU
#define RP2350_PIO_IRQ1_INTF         0x180U
#define RP2350_PIO_IRQ1_INTS         0x184U

/* CTRL register fields */
#define RP2350_PIO_CTRL_SM_ENABLE(sm)   (1U << (sm))
#define RP2350_PIO_CTRL_SM_RESTART(sm)  (1U << (4U + (sm)))
#define RP2350_PIO_CTRL_CLKDIV_RESTART(sm)  (1U << (8U + (sm)))

/* SHIFTCTRL register fields */
#define RP2350_PIO_SHIFTCTRL_AUTOPULL    (1U << 17)
#define RP2350_PIO_SHIFTCTRL_AUTOPUSH    (1U << 16)
#define RP2350_PIO_SHIFTCTRL_OUT_SHIFTDIR_RIGHT  (1U << 19)  /* 1=LSB */
#define RP2350_PIO_SHIFTCTRL_OUT_SHIFTDIR_LEFT   (0U)        /* 0=MSB */
#define RP2350_PIO_SHIFTCTRL_PULL_THRESH_SHIFT   25
#define RP2350_PIO_SHIFTCTRL_FJOIN_TX            (1U << 30)  /* 8-deep TX */
#define RP2350_PIO_SHIFTCTRL_FJOIN_RX            (1U << 31)

/* PINCTRL register fields */
#define RP2350_PIO_PINCTRL_OUT_BASE_SHIFT     0
#define RP2350_PIO_PINCTRL_SET_BASE_SHIFT     5
#define RP2350_PIO_PINCTRL_SIDESET_BASE_SHIFT 10
#define RP2350_PIO_PINCTRL_IN_BASE_SHIFT      15
#define RP2350_PIO_PINCTRL_OUT_COUNT_SHIFT    20
#define RP2350_PIO_PINCTRL_SET_COUNT_SHIFT    26
#define RP2350_PIO_PINCTRL_SIDESET_COUNT_SHIFT 29

/* IRQ0_INTE / INTS bit positions: SM[0..3] IRQ bits at [11..8],
 * plus per-SM TXNFULL[7..4] and RXNEMPTY[3..0] interrupts. */
#define RP2350_PIO_INT_SM0_IRQ       (1U << 8)
#define RP2350_PIO_INT_SM1_IRQ       (1U << 9)
#define RP2350_PIO_INT_SM2_IRQ       (1U << 10)
#define RP2350_PIO_INT_SM3_IRQ       (1U << 11)

/**
 * @brief NVIC IRQ numbers used by TikuOS (datasheet §3.6.1).
 *
 * Sourced from RP2350 datasheet IRQ mapping table and confirmed against
 * pico-sdk hardware/regs/intctrl.h.  Only the IRQs actually wired by
 * TikuOS drivers are listed here; others are omitted for brevity.
 */
#define RP2350_IRQ_TIMER0_0         0
#define RP2350_IRQ_TIMER0_1         1
#define RP2350_IRQ_DMA_IRQ_0        10
#define RP2350_IRQ_DMA_IRQ_1        11
#define RP2350_IRQ_DMA_IRQ_2        12
#define RP2350_IRQ_DMA_IRQ_3        13
#define RP2350_IRQ_PWM_IRQ_WRAP_0   14
#define RP2350_IRQ_PIO0_0           15
#define RP2350_IRQ_PIO0_1           16
#define RP2350_IRQ_PIO1_0           17
#define RP2350_IRQ_PIO1_1           18
#define RP2350_IRQ_PIO2_0           19
#define RP2350_IRQ_PIO2_1           20
#define RP2350_IRQ_IO_BANK0         21
#define RP2350_IRQ_UART0            33
#define RP2350_IRQ_UART1            34

/**
 * @brief Enable an IRQ in the Cortex-M33 NVIC.
 *
 * @param irq  IRQ number (RP2350_IRQ_*).
 */
static inline void rp2350_nvic_enable(uint32_t irq) {
    *(volatile uint32_t *)(RP2350_NVIC_ISER0 + (irq / 32U) * 4U)
        = (1U << (irq & 31U));
}

/**
 * @brief Disable an IRQ in the Cortex-M33 NVIC.
 *
 * @param irq  IRQ number (RP2350_IRQ_*).
 */
static inline void rp2350_nvic_disable(uint32_t irq) {
    *(volatile uint32_t *)(RP2350_NVIC_ICER0 + (irq / 32U) * 4U)
        = (1U << (irq & 31U));
}

/**
 * @brief Clear a pending IRQ in the Cortex-M33 NVIC.
 *
 * @param irq  IRQ number (RP2350_IRQ_*).
 */
static inline void rp2350_nvic_clear_pending(uint32_t irq) {
    *(volatile uint32_t *)(RP2350_NVIC_ICPR0 + (irq / 32U) * 4U)
        = (1U << (irq & 31U));
}

/*---------------------------------------------------------------------------*/
/* TRNG (True Random Number Generator) — RP2350 datasheet §12.13             */
/*---------------------------------------------------------------------------*/

/*
 * TRNG — ARM CryptoCell-312 derivative (datasheet §12.13).
 *
 * Sequence to fill EHR_DATA0..5 (192 random bits): unreset via RESETS
 * bit 25; disable RND_SOURCE_ENABLE; clear ICR; write TRNG_CONFIG and
 * SAMPLE_CNT1; enable RND_SOURCE_ENABLE; poll TRNG_VALID bit 0; read
 * EHR_DATA0..5 (reading clears VALID); then disable again.  The six
 * 32-bit EHR words provide 192 bits of entropy per cycle.
 */
/*
 * RP2350's TRNG block is a derivative of the ARM CryptoCell-312 TRNG.
 * Reference: pico-sdk-2.x hardware/regs/trng.h. Field names and
 * offsets match that header so a reader can cross-check.
 *
 * Sequence to fill EHR_DATA0..5 (192 random bits):
 *
 *   1. Unreset TRNG  (RESETS bit 25)
 *   2. RND_SOURCE_ENABLE = 0       (stop, in case it was running)
 *   3. ICR = 0x3F                  (clear all source-interrupt bits)
 *   4. TRNG_CONFIG = 0             (fastest ROSC chain — lowest entropy
 *                                   per bit, but enough for a first
 *                                   cut; raise to 1..3 if FIPS sees
 *                                   correlated output)
 *   5. SAMPLE_CNT1 = a few hundred (rosc cycles per sample)
 *   6. RND_SOURCE_ENABLE = 1       (start)
 *   7. spin while (TRNG_VALID & 1) == 0
 *   8. read EHR_DATA0..5           (six 32-bit words, side-effect: clears
 *                                   the VALID flag)
 *   9. RND_SOURCE_ENABLE = 0       (idle)
 *   loop from 5 if more bits wanted.
 */
#define RP2350_TRNG_RNG_IMR            (RP2350_TRNG_BASE + 0x100U)
#define RP2350_TRNG_TRNG_ISR           (RP2350_TRNG_BASE + 0x104U)
#define RP2350_TRNG_TRNG_ICR           (RP2350_TRNG_BASE + 0x108U)
#define RP2350_TRNG_CONFIG             (RP2350_TRNG_BASE + 0x10CU)
#define RP2350_TRNG_VALID              (RP2350_TRNG_BASE + 0x110U)
#define RP2350_TRNG_EHR_DATA0          (RP2350_TRNG_BASE + 0x114U)
#define RP2350_TRNG_EHR_DATA1          (RP2350_TRNG_BASE + 0x118U)
#define RP2350_TRNG_EHR_DATA2          (RP2350_TRNG_BASE + 0x11CU)
#define RP2350_TRNG_EHR_DATA3          (RP2350_TRNG_BASE + 0x120U)
#define RP2350_TRNG_EHR_DATA4          (RP2350_TRNG_BASE + 0x124U)
#define RP2350_TRNG_EHR_DATA5          (RP2350_TRNG_BASE + 0x128U)
#define RP2350_TRNG_RND_SOURCE_ENABLE  (RP2350_TRNG_BASE + 0x12CU)
#define RP2350_TRNG_SAMPLE_CNT1        (RP2350_TRNG_BASE + 0x130U)
#define RP2350_TRNG_AUTOCORR_STATISTIC (RP2350_TRNG_BASE + 0x134U)
#define RP2350_TRNG_DEBUG_CONTROL      (RP2350_TRNG_BASE + 0x138U)
#define RP2350_TRNG_SW_RESET           (RP2350_TRNG_BASE + 0x140U)
#define RP2350_TRNG_BUSY               (RP2350_TRNG_BASE + 0x1B8U)
#define RP2350_TRNG_RST_BITS_COUNTER   (RP2350_TRNG_BASE + 0x1BCU)

#define RP2350_TRNG_VALID_EHR_BIT      (1U << 0)

/*---------------------------------------------------------------------------*/
/* RESETS helpers                                                            */
/*---------------------------------------------------------------------------*/

/**
 * @brief Release a peripheral from reset and wait until it is ready.
 *
 * Clears the reset bit atomically via the CLR alias, then spins on
 * RESETS_RESET_DONE until the peripheral signals it is out of reset.
 *
 * @param mask  Bitmask of RP2350_RESETS_* bits for the target peripheral(s).
 */
static inline void rp2350_unreset(uint32_t mask) {
    _RP2350_REG_CLR(RP2350_RESETS_RESET, mask);
    while ((_RP2350_REG(RP2350_RESETS_RESET_DONE) & mask) != mask) {
        /* spin */
    }
}

/**
 * @brief Assert reset on a peripheral (hold it in reset).
 *
 * @param mask  Bitmask of RP2350_RESETS_* bits for the target peripheral(s).
 */
static inline void rp2350_reset(uint32_t mask) {
    _RP2350_REG_SET(RP2350_RESETS_RESET, mask);
}

#endif /* TIKU_RP2350_REGS_H_ */
